Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentData
Struct for passing a component name and its other data.
Remarks:
Matches dotDMPluginData_t on TS Core side.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentData.Number
The number of the component. Not necessarily unique, for example custom components all have number -1.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentData.Name
The textual identifier of the command.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentData.Type
The type of the component.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentData.Input
The user input needed for creating the component.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentData.#ctor(System.Int32,System.String,Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentType,Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentInput)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentData struct.
number: The numerical identifier of the component.
name: The textual identifier of the component.
type: The type of the component.
input: The input of the component.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentData.GetCurrent(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentData@)
Gets the Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData value describing the component which is currently being handled by TS core.
componentData: The Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData currently active in TS core, if any.
Returns: True if a component is currently active; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentData.Equals(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentData)
Determines whether the current value is equal to other.
other: The value to compare with.
Returns: True if both values are equal; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentData.Equals(System.Object)
Determines whether other is of type Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentData
and whether the current value is equal to other.
other: The value to compare with.
Returns: True if both values are equal; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentData.GetHashCode
Gets a hash code for the current value.
Returns: A hash code for the current value.